[
    {
        "jobTitle": "Fullstack Software Engineer Internship",
        "companyName": "Codyn",
        "date": "2021~Current",
        "responsibilities": "• Engaged in an internal company initiative aimed at facilitating CRUD operations and enhancing productivity tracking for users. \n • Orchestrated the development of a backend RESTful API in Java Spring, seamlessly integrating with a PostgreSQL Database through the JOOQ framework to ensure robustness and type safety in SQL query execution. \n •  Implemented rigorous unit and end-to-end (E2E) testing protocols across the application spectrum, guaranteeing its readiness for deployment to production environments. \n • Spearheaded the creation of the frontend interface utilizing Vue3 and Vite, facilitating seamless interaction with backend API endpoints. \n • Contributed to the project's version control process by generating pull requests and maintaining a consistent cadence of updates to the repository, fostering a deeper understanding of the company's Git workflow."
    },

    {
        "jobTitle": "HVAC & MEP Engineer | Draftsman",
        "companyName": "Aspire Drafting",
        "date": "2021~Current",
        "responsibilities": "• Pioneered the development of automated Dynamo scripts using Python and C#, resulting in a remarkable 50% reduction in plot sheet drawing production time, thereby single handedly enhancing efficiency and optimizing project timelines within the company. \n • Drafted the HVAC and MEP systems for various commercial and industrial projects using AutoCAD & Revit, ensuring compliance with industry standards and local codes. \n • Collaborated with architects, engineers, and contractors during live meetings to coordinate MEP systems and resolve a 100% of the conflicts during the design and construction phases. \n • Developed comprehensive design documentation, including specifications, and drawings."
    },

    {
        "jobTitle": "Mechanical Engineer",
        "companyName": "University Of Science & Technology Wroclaw",
        "date": "",
        "responsibilities": "• Developed an easy-to-use online Engineering calculator for quick calculations in selecting duct sizes and pipe diameters. \n •  Designed HVAC, Plumbing, and Fire Protection systems for various buildings, ensuring they meet industry standards. \n •  Conducted heating and cooling calculations for HVAC systems and selected equipment accordingly. \n • Created detailed plotsheets with a focus on clarity and neatness. \n • Completed coursework covering essential calculations for HVAC, Plumbing, and Fire Protection systems."
    }
]