[

    {
        "jobTitle": "Junior Mechanical Engineer",
        "companyName": "Arcadis, NYC",
        "date": "| 2025 - Current |",
        "responsibilities": "• Designed HVAC, plumbing, and fire protection systems for municipal, industrial water/wastewater facilities, and specialized projects (e.g., manufacturing, life sciences). \n • Performed load calculations, pressure drop analyses, and equipment selections to develop optimal project solutions. \n • Prepared construction-ready drawing packages with inter-discipline coordination, ensuring constructability, reliability, and cost efficiency. \n • Ensured designs met requirements for redundancy, capacity, safety, and energy efficiency. \n • Conducted engineering site surveys, system audits, and data collection to support system studies. \n • Collaborated with senior engineers, project teams, sales representatives, and clients to develop solutions for complex, multi-trade projects. \n • Drafted and designed detailed HVAC and plumbing drawings to support project progression across multiple phases. \n • Applied knowledge of industry standards, building codes, and safety regulations (e.g., ASHRAE, IPC, ANSI, NFPA, NYC PC, UPC, NYC Building Code). \n • Developed an Excel macro-based project management tool that streamlined tracking of project progress and deadlines for senior staff."
    },

    {
        "jobTitle": "BIM Coordinator/Draftsman",
        "companyName": "Aspire Drafting, NYC",
        "date": "| 2021 - 2025 |",
        "responsibilities": "• Developed and implemented automated Dynamo scripts using Python and C#, increasing production efficiency by 50% and reducing project delivery times by an average of 30%, saving over 100 hours annually. \n • Drafted HVAC and MEP systems for over 25 commercial and industrial projects using AutoCAD & Revit, achieving 100% compliance with industry standards and local codes, resulting in a 20% reduction in rework costs. \n • Led and participated in cross-trade coordination of MEP systems with architects, engineers, and contractors in 50+ live meetings, cutting project delays by 15% and streamlining communication across departments. \n • End-to-end project management for complex, high-value projects, driving successful completion within budget and timeline constraints and contributing to a 25% increase in client satisfaction and retention."
    },

    {
        "jobTitle": "Mechanical Engineer",
        "companyName": "University Of Science & Technology Wroclaw",
        "date": "",
        "responsibilities": "• Developed an easy-to-use online Engineering calculator for quick calculations in selecting duct sizes and pipe diameters. \n •  Designed HVAC, Plumbing, and Fire Protection systems for various buildings, ensuring they meet industry standards. \n •  Conducted heating and cooling calculations for HVAC systems and selected equipment accordingly. \n • Created detailed plotsheets with a focus on clarity and neatness. \n • Completed coursework covering essential calculations for HVAC, Plumbing, and Fire Protection systems."
    }
]